const event = new Date(Date.UTC(2012, 11, 20, 3, 0, 0));

// Британська англійська використовує порядок день-місяць-рік і 24-годинний час, без AM чи PM
console.log(event.toLocaleString('en-GB', { timeZone: 'UTC' }));
// Очікуваний вивід: 20/12/2012, 03:00:00

// Корейська використовує порядок рік-місяць-день і 12-годинний час, із AM чи PM
console.log(event.toLocaleString('ko-KR', { timeZone: 'UTC' }));
// Очікуваний вивід: 2012. 12. 20. 오전 3:00:00

// Українська використовує порядок день-місяць-рік і 24-годинний час, без AM чи PM
console.log(event.toLocaleString('uk-UA', { timeZone: 'UTC' }));
// Очікуваний вивід: 20.12.2012, 03:00:00
