const p = 'Гей, хлопці, не вспію - на ґанку ваша файна їжа знищується бурундучком. Певне справді файна була!';

console.log(p.replaceAll('файна', 'смачна'));
// очікуваний вивід: "Гей, хлопці, не вспію - на ґанку ваша смачна їжа знищується бурундучком. Певне справді смачна була!"


// позначка "global" — обов'язкова при викликанні replaceAll із регулярними виразами
const regex = /Файна/ig;
console.log(p.replaceAll(regex, 'гаряча'));
// очікуваний вивід: "Гей, хлопці, не вспію - на ґанку ваша гаряча їжа знищується бурундучком. Певне справді гаряча!"
